HashCode and Equality.md.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#object.hashcode-and-equals">1. Object.hashCode and Equals</a>
<ul>
<li><a href="#comparing-instances">1.1. Comparing instances</a>
<ul>
<li><a href="#point.java">1.1.1. Point.java</a></li>
</ul>
</li>
<li><a href="#main.java">1.2. Main.java</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-object.hashcode-and-equals" class="outline-2">
<h2 id="object.hashcode-and-equals"><span class="section-number-2">1.</span> Object.hashCode and Equals</h2>
<div class="outline-text-2" id="text-object.hashcode-and-equals">
<p>
address of object goes through a hash function which returns the
hashCode (integer) of that object. (hash maps an Object's <code>address</code> to
an <code>integer</code>)
</p>

<p>
See below example: Returns <b>true</b> as both <code>box1</code> and <code>box2</code> are
referencing the same address in memory.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Where TextBox is some arbitrary Class
</span><span class="org-type">var</span> <span class="org-variable-name">box1</span> = <span class="org-keyword">new</span> <span class="org-type">TextBox</span>();
<span class="org-type">var</span> <span class="org-variable-name">box2</span> = box1;
System.out.println(box1.hashCode()); <span class="org-comment-delimiter">// </span><span class="org-comment">112810359
</span>System.out.println(box2.hashCode()); <span class="org-comment-delimiter">// </span><span class="org-comment">112810359
</span>System.out.println(box1.equals(box2)); <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
</pre>
</div>

<p>
Whereas below example, <code>box1</code> and <code>box2</code> reference <b>different</b> memory
addresses.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Where TextBox is some arbitrary Class
</span><span class="org-type">var</span> <span class="org-variable-name">box1</span> = <span class="org-keyword">new</span> <span class="org-type">TextBox</span>();
<span class="org-type">var</span> <span class="org-variable-name">box2</span> = <span class="org-keyword">new</span> <span class="org-type">TextBox</span>();
System.out.println(box1.hashCode()); <span class="org-comment-delimiter">// </span><span class="org-comment">112810359
</span>System.out.println(box2.hashCode()); <span class="org-comment-delimiter">// </span><span class="org-comment">243083622
</span>System.out.println(box1.equals(box2)); <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
</pre>
</div>

<p>
<code>Object.toString()</code> returns the string representation of object (full
qualifier name of class (including package), #, then hashCode in Hex)
</p>

<p>
i.e. <code>com.demo.TextBox@6b95977</code>
</p>

<div class="org-src-container">
<pre class="src src-java">System.out.println(box1.hashCode()); <span class="org-comment-delimiter">// </span><span class="org-comment">112810359
</span>System.out.println(box1.toString()); <span class="org-comment-delimiter">// </span><span class="org-comment">com.demo.TextBox@6b95977
</span><span class="org-type">int</span> <span class="org-variable-name">parsedHash</span> = Integer.parseInt(<span class="org-string">"6b95977"</span>, 16);
System.out.println(parsedHash); <span class="org-comment-delimiter">// </span><span class="org-comment">112810359</span>
</pre>
</div>
</div>

<div id="outline-container-comparing-instances" class="outline-3">
<h3 id="comparing-instances"><span class="section-number-3">1.1.</span> Comparing instances</h3>
<div class="outline-text-3" id="text-comparing-instances">
</div>
<div id="outline-container-point.java" class="outline-4">
<h4 id="point.java"><span class="section-number-4">1.1.1.</span> Point.java</h4>
<div class="outline-text-4" id="text-point.java">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> com.<span class="org-constant">demo</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Point</span> {
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">X</span>;
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">Y</span>;

    <span class="org-keyword">public</span> Point(<span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">y</span>) {
        X = x;
        Y = y;
    }

    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getX</span>() {
        <span class="org-keyword">return</span> X;
    }
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setX</span>(<span class="org-type">int</span> <span class="org-variable-name">x</span>) {
        X = x;
    }
    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">getY</span>() {
        <span class="org-keyword">return</span> Y;
    }
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">setY</span>(<span class="org-type">int</span> <span class="org-variable-name">y</span>) {
        Y = y;
    }

    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">boolean</span> <span class="org-function-name">equals</span>(<span class="org-type">Object</span> <span class="org-variable-name">obj</span>) {
        <span class="org-keyword">if</span>(<span class="org-keyword">this</span> == obj) <span class="org-keyword">return</span> <span class="org-constant">true</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Check reference equality
</span>        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>(obj <span class="org-keyword">instanceof</span> Point))
          <span class="org-keyword">return</span> <span class="org-constant">false</span>;
        <span class="org-type">var</span> <span class="org-variable-name">other</span> = (<span class="org-type">Point</span>)obj;
        <span class="org-keyword">return</span> <span class="org-constant">other</span>.X == X &amp;&amp; <span class="org-constant">other</span>.Y == Y;
    }

    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-function-name">hashCode</span>() {
        <span class="org-keyword">return</span> Objects.hash(X, Y);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-main.java" class="outline-3">
<h3 id="main.java"><span class="section-number-3">1.2.</span> Main.java</h3>
<div class="outline-text-3" id="text-main.java">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> com.<span class="org-constant">demo</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Main</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">var</span> <span class="org-variable-name">point1</span> = <span class="org-keyword">new</span> <span class="org-type">Point</span>(1, 2);
        <span class="org-type">var</span> <span class="org-variable-name">point2</span> = <span class="org-keyword">new</span> <span class="org-type">Point</span>(1, 2);
        System.out.println(point1.equals(point2));
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
